{
    "This function returns the minimum x-coordinate value from a set of coordinates in a project.": "Box2D.java double getMinX()",
    "This function returns the minimum Y-coordinate value from a set of coordinates in a project.": "Box2D.java double getMinY()",
    "This function returns the width of a shape, which is a key measurement used in various calculations within the project.": "Box2D.java double getWidth()",
    "This function returns the height of a shape, which is essential for calculating area and volume in geometry.": "Box2D.java double getHeight()",
    "This function calculates and returns the maximum x-coordinate of a shape based on its starting x-coordinate and width.": "Box2D.java double getMaxX()",
    "Function calculates and returns the maximum y-coordinate of a rectangle based on its position and dimensions.": "Box2D.java double getMaxY()",
    "This function calculates a hash code based on the coordinates and sides of an object for identification purposes.": "Box2D.java int hashCode()",
    "This function checks if two Box2D objects are equal by comparing their coordinates and sides.": "Box2D.java boolean equals(Object obj)",
    "This function returns a string representation of a Box2D object's coordinates and sides.": "Box2D.java String toString()",
    "Creates a new 2D box with specified width and height for use in a project.": "Box2D.java Box2D of(double width, double height)",
    "Creates a new 2D box object with specified coordinates, width, and height for use in a project.": "Box2D.java Box2D of(double x, double y, double width, double height)",
    "Check if a point is within a 2D box in a project.": "Boxes.java boolean containsPoint(Box2D box, Point2D p)",
    "Function splits a Box2D object along the Y-axis into two equal parts.": "Boxes.java Pair<Box2D, Box2D> splitAlongYAxis(Box2D box)",
    "Function checks if a point is within a 2D box using a custom comparator.": "Boxes.java boolean containsPoint(Box2D box, Point2D p, Comparator<Double> comparator)",
    "This function retrieves the first element in a data structure, providing access to the initial data point.": "Pair.java A getFirst()",
    "Function returns the second element in a pair within a project, supporting data retrieval and manipulation.": "Pair.java B getSecond()",
    "This function sets the value of the first element in a data structure within a project.": "Pair.java void setFirst(A f)",
    "This function sets the value of the second variable in a project, allowing for easy manipulation and comparison.": "Pair.java void setSecond(B s)",
    "This function checks if a specified element is present in the first or second position within a project.": "Pair.java <E> boolean hasElement(E e)",
    "This function converts a pair of values into a string representation for display or logging purposes.": "Pair.java String toString()",
    "Function to check if two Pair objects are equal based on their first and second values.": "Pair.java boolean equals(Object o)",
    "This function calculates a hash code based on the values of two objects, used for efficient data retrieval.": "Pair.java int hashCode()",
    "Creates a pair of two objects for use in the project, simplifying data organization and manipulation.": "Pair.java <A, B> Pair<A, B> of(A a, B b)"
}